In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([7,15,4,4,7,4],index=['r1','r2','r3','r4','r5','r6',])
s

r1     7
r2    15
r3     4
r4     4
r5     7
r6     4
dtype: int64

In [3]:
s.r2

np.int64(15)

In [4]:
s.values

array([ 7, 15,  4,  4,  7,  4])

In [5]:
s.index

Index(['r1', 'r2', 'r3', 'r4', 'r5', 'r6'], dtype='object')

In [6]:
s.value_counts()

4     3
7     2
15    1
Name: count, dtype: int64

In [7]:
df=pd.DataFrame([[1,2],[3,4],[5,6],[7,8]],index=['r1','r2','r3','r4'],columns=['c1','c2'])
df

    c1  c2
r1   1   2
r2   3   4
r3   5   6
r4   7   8

In [8]:
df[1:3]

    c1  c2
r2   3   4
r3   5   6

In [9]:
df['c2']

r1    2
r2    4
r3    6
r4    8
Name: c2, dtype: int64

In [10]:
df.iloc[2,1]

np.int64(6)

In [11]:
df.values

array([[1, 2],
       [3, 4],
       [5, 6],
       [7, 8]])

In [12]:
df[df<5
]

     c1   c2
r1  1.0  2.0
r2  3.0  4.0
r3  NaN  NaN
r4  NaN  NaN

In [13]:
df.head(3)

    c1  c2
r1   1   2
r2   3   4
r3   5   6

In [14]:
df.tail(1)

    c1  c2
r4   7   8

In [15]:
df.index

Index(['r1', 'r2', 'r3', 'r4'], dtype='object')

In [16]:
df.columns

Index(['c1', 'c2'], dtype='object')

In [17]:
df.T

    r1  r2  r3  r4
c1   1   3   5   7
c2   2   4   6   8

In [18]:
df.drop('r3',axis=0)

    c1  c2
r1   1   2
r2   3   4
r4   7   8

In [19]:
df.drop('c2',axis=1)

    c1
r1   1
r2   3
r3   5
r4   7

In [20]:
df.describe()

             c1        c2
count  4.000000  4.000000
mean   4.000000  5.000000
std    2.581989  2.581989
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.500000  6.500000
max    7.000000  8.000000

In [45]:
df=pd.DataFrame({'x4':[11,2],'x5':[9,4],'x1':[8,6]})
df

   x4  x5  x1
0  11   9   8
1   2   4   6

In [46]:
df.sort_index(axis=1,ascending=False)

   x5  x4  x1
0   9  11   8
1   4   2   6

In [48]:
df.sort_values(by='x5')

   x4  x5  x1
1   2   4   6
0  11   9   8

In [51]:
df[df.x5<5]

   x4  x5  x1
1   2   4   6

In [56]:
df.iloc[1]['x5']

np.int64(4)

In [57]:
pd.DataFrame(np.random.rand(10,4))

          0         1         2         3
0  0.712056  0.486005  0.132093  0.236936
1  0.015388  0.785249  0.479608  0.011306
2  0.673025  0.731410  0.397411  0.664512
3  0.241416  0.447547  0.166587  0.873738
4  0.181698  0.329838  0.548835  0.219838
5  0.865459  0.816953  0.966643  0.842952
6  0.394316  0.148598  0.307597  0.311250
7  0.841176  0.077948  0.341064  0.923112
8  0.844682  0.598424  0.612830  0.918035
9  0.665522  0.512266  0.342731  0.784808